""" 01 Удаление лишних символов

Напишите программу, которая
- создает новую строку,
- удаляя из строки все символы, кроме
    - букв, цифр и пробелов.

Пример вывода:
Строка до обработки: Hello, World! 2025...
Результат: Hello World 2025
"""

text = "Hello, World! 2025..."
print("Строка до обработки:", text)




print("Результат:", new_text)
