""" 02. Шифр Цезаря

Напишите программу для дешифровки текста, зашифрованного с помощью шифра Цезаря.

Программа принимает
- зашифрованный текст
- и сдвиг (использованный для зашифровки) от пользователя
- и выводит расшифрованный текст.

Шифр Цезаря — это один из самых простых и известных методов шифрования.
В этом методе каждый символ в исходном тексте заменяется на символ,
находящийся на фиксированное число позиций дальше в алфавите.
Сдвиг может быть как влево, так и вправо,
и для расшифровки необходимо просто сдвинуть символы обратно на тот же шаг.

Пример вывода:
Введите зашифрованный текст: khoor
Введите сдвиг: 3
Расшифрованный текст: hello
"""