""" 04 Извлечение номеров банковских карт

Реализуйте программу, которая должна
- найти все номера карт,
    - записанные как 16 цифр,
    - разделённые блоками по 4 цифры
        - пробелами,
        - дефисами
        - или без разделителей.


text = '''
Valid examples:
1234 5678 9012 3456
4321-8765-2109-6543
1234567812345678
1234-5678 9012-3456

Invalid examples:
123456781234567
1234/5678/9012/3456
1234 5678 9012
1234-5678-ABCD-3456
1234--5678--9012--3456
1234 56789 012 3456
'''

Пример вывода:
Валидные номера:
1234 5678 9012 3456
4321-8765-2109-6543
1234567812345678
1234-5678 9012-3456

"""
import re

text = """
Valid examples:
1234 5678 9012 3456
4321-8765-2109-6543
1234567812345678
1234-5678 9012-3456

Invalid examples:
123456781234567
1234/5678/9012/3456
1234 5678 9012
1234-5678-ABCD-3456
1234--5678--9012--3456
1234 56789 012 3456
"""

pass

# Валидные номера:
# 1234 5678 9012 3456
# 4321-8765-2109-6543
# 1234567812345678
# 1234-5678 9012-3456

